//
//  Tone.swift
//  arm-instrument
//
//  Created by 匿名 on 2022/12/21.
//

import Foundation
class Tone: NSObject {
    let scaleMap: [Double: [String: String]] = [
        27.500: ["us": "A0", "jp": "ラ0"],
        29.135: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
        27.500: ["us": "A0", "jp": "ラ0"],
    ]
}
